Конфигурация отчетов/Documents/ЗаписьАтрибутаЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаписьАтрибутаЗадачи</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Атрибут</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АтрибутыЗадачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация отчетов/Documents/ЗаписьАтрибутаЗадачи/Ext/ManagerModule.bsl
Функция СоздатьЗаписьАтрибута(Задача, Атрибут, Значение, Автор) Экспорт 
	
	Док = Документы.ЗаписьАтрибутаЗадачи.СоздатьДокумент();
	Док.Дата        = ТекущаяДата();
	Док.Задача    = Задача; 
	Док.Атрибут = Атрибут;
	Док.Значение    = Значение; 
	Док.Автор = Автор;

	Док.Записать(РежимЗаписиДокумента.Проведение);
	
	Сообщить(Строка(Атрибут) + " успешно обновлен!" );
	Возврат Док.Ссылка;
	
КонецФункции
